Tekla.Structures.Catalogs.MaterialMarketSizesItemEnumerator
The MaterialMarketSizesItemEnumerator class allows to loop through the items defined in XS_PROFDB\marketsizes.dat file.
The following example returns true if an item with the name S235JR has been found and
there is at least one market size for the item:
using Tekla.Structures.Catalogs;
public class Example
{
public bool Example1()
{
bool result = false;
CatalogHandler catalogHandler = new CatalogHandler();
if (catalogHandler.GetConnectionStatus())
{
try
{
MaterialMarketSizesItemEnumerator marketSizesEnumerator = catalogHandler.GetMaterialMarketSizes();
while (marketSizesEnumerator.MoveNext())
{
MaterialMarketSizesItem materialSpecificMarketSizes = marketSizesEnumerator.Current as MaterialMarketSizesItem;
if (materialSpecificMarketSizes != null)
{
if (materialSpecificMarketSizes.MaterialName == "S235JR")
{
if (materialSpecificMarketSizes.MarketSizes != null)
{
if (materialSpecificMarketSizes.MarketSizes.Length > 0)
{
result = true;
break;
}
}
}
}
}
}
catch(CatalogItemEnumeratorInitializationException e)
{
// Handle the exception here and see the inner exception for more details.
}
}
return result;
}
}

Tekla.Structures.Catalogs.MaterialMarketSizesItemEnumerator.System#Collections#IEnumerator#Current
Implementation for the Curret property required by IEnumerator. The returned object
is always of type MaterialMarketSizesItem.

Tekla.Structures.Catalogs.MaterialMarketSizesItemEnumerator.Current
Returns a MaterialMarketSizesItem instance with the current index.
Throws System.InvalidOperationException: Thrown when Current item cannot be accessed from the given location.

Tekla.Structures.Catalogs.MaterialMarketSizesItemEnumerator.#ctor
Creates an instance of MaterialMarketSizesItemEnumerator and initializes it.
Data is fetched from XS_PROFDB\marketsizes.dat file.
Throws Tekla.Structures.Catalogs.CatalogItemEnumeratorInitializationException: Thrown when initialization of MaterialMarketSizesItemEnumerator fails.

Tekla.Structures.Catalogs.MaterialMarketSizesItemEnumerator.#ctor(System.String)
Creates an instance of MaterialMarketSizesItemEnumerator and initializes it.
Data is fetched from the file located at the given file path (e.g. ...\temp\marketsizes.dat).
filePath: File path to marketsizes.dat file. File path should contain the whole path (e.g. ...\temp\marketsizes.dat)
Throws Tekla.Structures.Catalogs.CatalogItemEnumeratorInitializationException: Thrown when initialization of MaterialMarketSizesItemEnumerator fails.

Tekla.Structures.Catalogs.MaterialMarketSizesItemEnumerator.MoveNext
Moves to the next item in the MaterialMarketSizesItemEnumerator.
Returns: False on failure.

Tekla.Structures.Catalogs.MaterialMarketSizesItemEnumerator.Reset
Resets the MaterialMarketSizesItemEnumerator to the beginning.

Tekla.Structures.Catalogs.MaterialMarketSizesItemEnumerator.InitializeMarketSizes(System.String)
Method for initializing MaterialMarketSizesItemEnumerator data
filePath: File path to marketsizes.dat file. File path should contain the whole path (e.g. ...\temp\marketsizes.dat).
If the given path is empty, default path (XS_PROFDB\marketsizes.dat) is used.
Throws Tekla.Structures.Catalogs.CatalogItemEnumeratorInitializationException: Thrown when initialization of MaterialMarketSizesItemEnumerator fails.

Tekla.Structures.Catalogs.MaterialMarketSizesItemEnumerator.FillMarketSizes(System.String[])
Method for populating the available MarketSizes according to data content
linesFromDataFile: Array of strings representing the lines in marketsizes.dat file